{
    "List1": {
        "title": "Top 12 Highest Paying Jobs in Technology in India [2024]",
        "img": "https://www.upgrad.com/__khugblog-next/image/?url=https%3A%2F%2Fd14b9ctw0m6fid.cloudfront.net%2Fugblog%2Fwp-content%2Fuploads%2F2020%2F08%2F895.png&w=750&q=75",
        "url": "https://www.upgrad.com/blog/highest-paying-jobs-technology-india/",
        "desc": "Technology is ever-changing, and career paths evolve with it. IT professionals are always looking to gain new skills and advance to higher positions. And many others think about transitioning to this sector for some reason or the other. If you, too, are considering an IT career, it would be good to know about the highest paying jobs in technology. We have compiled a list of posts with their job specifications and average salary to guide you better. "
    },
    "List2": {
        "title": "6 Coding Trends for 2024 and Beyond",
        "img": "https://ucarecdn.com/a818d055-fdc4-474b-9f95-b7ebc79fbf10/-/resize/600/",
        "url": "https://www.codementor.io/blog/coding-trends-2024-ifmigy3uyl",
        "desc": "According to MarketSplash, there are more than 27 million software developers worldwide. Moreover, the software market revenue is expected to grow to almost $660 billion by the end of 2023.The suggestion that the coding market is saturated makes sense. Still, if you are thinking about becoming a developer yourself without any prior coding background, you can still go for it."
    },
    "List3": {
        "title": "Top 40 Android Project Ideas & Topics of 2024 [Source Code]",
        "img": "https://www.knowledgehut.com/_next/image?url=https%3A%2F%2Fd2o2utebsixu4k.cloudfront.net%2Fmedia%2Fimages%2F57d37ce2-343e-4244-9e97-19548b001598.png&w=750&q=75",
        "url": "https://www.knowledgehut.com/blog/web-development/android-project-ideas",
        "desc": "In this blog post, we will outline some of the best Android app project ideas and concepts for you to consider when starting your next project. We will also provide helpful tips on how to select the right idea or topic for your specific needs. And with a Full Stack Developer certification course, you'll be well on your way to becoming a professional Android developer."
    },
    "List4": {
        "title": "15+ Web Development Projects With Source Code [2024]",
        "img": "https://www.interviewbit.com/blog/wp-content/uploads/2022/01/Web-Development-Projects-1-800x391.png",
        "url": "https://www.interviewbit.com/blog/web-development-projects/",
        "desc": "As per an estimate, more than 1.7 billion websites exist, the number fluctuates daily. The web is super massive and 4.5 billion people across the world contribute with online interactions. All credit to the rapid development towards taking our businesses on the web and the digital revolution. The development did not take place all of a sudden, it was a rather slow process. The users entered the era of the World Wide Web only when the visual-oriented web browsers came in the 1990s, and since then there has been an exponential increase in web technology, the craze for web development is at its peak now. Sounds pretty exciting, right?"
    },
    "List5": {
        "title": "10 Best Laptops For Programming in India (2024) - Buyer's Guide",
        "img": "https://images.indulgexpress.com/indulgeoffers/assets/images/content/2022/10/26/original/Best-Laptops-for-Programming.jpg",
        "url": "https://www.indulgexpress.com/indulgeoffers/laptops/best-laptops-for-programming-in-india--buyers-guide/185.html",
        "desc": "Looking for the best laptop for programming to create and execute a computer program without any hassles? Explore our comprehensive list of the top 10 programming laptops in India, along with their prices, specifications and pros and cons to pick the best laptop for coding as per your requirements."
    }
}