{
    "jobs":{
        "job1": {
            "title": "Software Engineering Intern, Summer 2024",
            "company":"Google",
            "logo":"https://lh3.googleusercontent.com/COxitqgJr1sJnIDe8-jiKhxDx1FrYbtRHKJ9z_hELisAlapwE9LUPh6fcXIfb5vwpbMl4xl9H9TRFPc5NOO8Sb3VSgIBrfRYvW6cUA",
            "about":{
                "p1":"Software Engineering Interns at Google are researchers and developers who yearn to create and implement complex computer science solutions. Our engineers develop massively scalable, distributed software systems and also collaborate on multitudes of smaller projects that have universal appeal - this requires research, awareness, interactivity and the ability to ask the right questions. You'll develop effective competencies in data structures and algorithms, along with a technical fascination for how stuff fits together. You'll also have a solid foundation in computer science, allowing you to come up with new ideas, as well as to strive for a deep understanding of our products and services in order to continually improve upon them. We focus on being a collaborative, global organization consisting of engineers with the highest levels of technical depth, programming skills, and a keen attention for quality.\n\nIn this role, you will work on our core products and services as well as those which support critical functions of our engineering operations. Depending on your background and experience, you will be working in one of the following areas:",
                "p2":"Product and Systems Development: Whether it's finding new and innovative ways to advance search quality, building computing platforms and networking technologies, automating the indexing of videos, or continuing to refine and scale complex auction systems, you will be developing solutions to some of the most challenging technical problems out there. You will research, conceive and develop software applications to extend and improve on Google's product offerings and collaborate on scalability issues involving access to massive amounts of data and information. Examples of specialist domains include UI development with various technologies, security, embedded systems and mobile apps (Android), and developer tools (e.g., IDEs, large-scale build systems, compilers).",
                "p3":"Engineering Productivity: As a Software Engineer in the Engineering Productivity organization, you'll use your software design, analysis and programming skills to create innovative automated test systems. This isn't a job in which you'll simply debug and run test cases, in fact that only scratches the surface. The test team undertakes a broad range of challenges on a daily basis, designing and building intelligent systems that can explore various use cases and scenarios for distributed computing infrastructure. Just imagine trying to design and build an automated testing system for something that's never been done before.",
                "p4":"Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to address some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another."
            },
            "min_qualification":{
               "p1": "Currently pursuing a Bachelor's, Master's or PhD in Computer Science or a related technical field.",
               "p2":"Experience with data structures or algorithms."
            },
            "preferred_qualifications":{
                "p1": "Currently in your penultimate year.",
                "p2":"Experience with Unix/Linux, Machine Learning, Tensorflow, or embedded systems.",
                "p3":"Experience programming in one of the following language: C, C++, Java, and/or Python.",
                "p4":"Ability to complete an internship program of 10-12 weeks.."
             },
            "apply":"https://www.google.com/about/careers/applications/jobs/results/88174919918985926-software-engineering-intern-summer-2024?src=Online/Google%20Website/ByF&utm_source=Online%20&utm_medium=careers_site%20&utm_campaign=ByF&company=Fitbit&company=Google&company=YouTube&distance=50&employment_type=INTERN",
            "deadline":"Please complete your application before Mar 15th, 2024."
        },
        "job2":{
            "title":"2 Software Engineering Intern, Summer 2024"
        }
    }
}